-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: hys_db
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `hysa`
--

DROP TABLE IF EXISTS `hysa`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hysa` (
  `hysAid` int NOT NULL AUTO_INCREMENT COMMENT '管理员id',
  `hysAname` varchar(50) DEFAULT NULL COMMENT '管理员姓名',
  `hysAphone` varchar(11) DEFAULT NULL COMMENT '管理员手机号',
  `hysAmail` varchar(50) DEFAULT NULL COMMENT '管理员邮箱',
  `hysApass` varchar(100) DEFAULT NULL COMMENT '管理员密码',
  PRIMARY KEY (`hysAid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='管理员表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hysa`
--

LOCK TABLES `hysa` WRITE;
/*!40000 ALTER TABLE `hysa` DISABLE KEYS */;
/*!40000 ALTER TABLE `hysa` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hysc`
--

DROP TABLE IF EXISTS `hysc`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hysc` (
  `hysCid` int NOT NULL AUTO_INCREMENT COMMENT '评论表ID',
  `hysCidU` int DEFAULT NULL COMMENT '用户id',
  `hysCidMO` int DEFAULT NULL COMMENT '模组id',
  `hysCtxt` varchar(500) DEFAULT NULL COMMENT '评论内容',
  `hysCtime` datetime DEFAULT (now()) COMMENT '评论时间',
  PRIMARY KEY (`hysCid`),
  KEY `hysC_id_MO_fk` (`hysCidMO`),
  KEY `hysC_id_U_fk` (`hysCidU`),
  CONSTRAINT `hysC_id_MO_fk` FOREIGN KEY (`hysCidMO`) REFERENCES `hysmo` (`hysMOid`),
  CONSTRAINT `hysC_id_U_fk` FOREIGN KEY (`hysCidU`) REFERENCES `hysu` (`hysUid`)
) ENGINE=InnoDB AUTO_INCREMENT=10016 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hysc`
--

LOCK TABLES `hysc` WRITE;
/*!40000 ALTER TABLE `hysc` DISABLE KEYS */;
INSERT INTO `hysc` VALUES (10000,10000,10000,'这是10000的留言','2024-12-29 21:26:26'),(10001,10000,10000,'这是10001的留言','2024-12-29 21:26:26'),(10002,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10003,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10004,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10005,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10006,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10007,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10008,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10009,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10010,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10011,10004,10000,'这是10001的留言','2024-12-29 21:26:26'),(10012,10004,10000,'1231231','2024-12-31 01:20:16'),(10013,10004,10009,'123123123','2024-12-31 01:20:34'),(10014,10004,10061,'12312312','2024-12-31 01:20:50'),(10015,10004,10011,'1231231','2024-12-31 01:26:42');
/*!40000 ALTER TABLE `hysc` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hysme`
--

DROP TABLE IF EXISTS `hysme`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hysme` (
  `hysMEid` int NOT NULL AUTO_INCREMENT COMMENT '留言ID',
  `hysMEtxt` varchar(500) DEFAULT NULL COMMENT '内容',
  `hysMEtime` datetime DEFAULT (now()) COMMENT '时间',
  `hysMEtoid` int DEFAULT NULL COMMENT '被留言ID',
  `hysMEidU` int DEFAULT NULL COMMENT '用户ID',
  PRIMARY KEY (`hysMEid`),
  KEY `hysME_id_U_fk` (`hysMEidU`),
  KEY `hysME_toid_U_fk` (`hysMEtoid`),
  CONSTRAINT `hysME_id_U_fk` FOREIGN KEY (`hysMEidU`) REFERENCES `hysu` (`hysUid`),
  CONSTRAINT `hysME_toid_U_fk` FOREIGN KEY (`hysMEtoid`) REFERENCES `hysu` (`hysUid`)
) ENGINE=InnoDB AUTO_INCREMENT=10016 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='留言表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hysme`
--

LOCK TABLES `hysme` WRITE;
/*!40000 ALTER TABLE `hysme` DISABLE KEYS */;
INSERT INTO `hysme` VALUES (10000,'这是留言','2024-12-29 21:25:43',10001,10000),(10001,'这是留言','2024-12-29 21:25:43',10004,10000),(10002,'这是留言','2024-12-29 21:25:43',10004,10000),(10003,'这是留言','2024-12-29 21:25:43',10004,10000),(10004,'这是留言','2024-12-29 21:25:43',10004,10000),(10005,'这是留言','2024-12-29 21:25:43',10004,10000),(10006,'这是留言','2024-12-29 21:25:43',10004,10000),(10007,'这是留言','2024-12-29 21:25:43',10004,10000),(10008,'这是留言','2024-12-29 21:25:43',10004,10000),(10009,'这是留言','2024-12-29 21:25:43',10004,10000),(10013,'1111','2024-12-31 00:24:06',10000,10004),(10014,'123123123','2024-12-31 00:24:41',10000,10004),(10015,'1231231','2024-12-31 00:24:52',10004,10000);
/*!40000 ALTER TABLE `hysme` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hysmo`
--

DROP TABLE IF EXISTS `hysmo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hysmo` (
  `hysMOid` int NOT NULL AUTO_INCREMENT COMMENT '模组ID',
  `hysMOidT` int DEFAULT NULL COMMENT '类ID',
  `hysMOidU` int DEFAULT NULL COMMENT '上传者id',
  `hysMOname` varchar(255) DEFAULT NULL COMMENT '模组名称',
  `hysMOfile` varchar(255) DEFAULT NULL COMMENT '文件名',
  `hysMOdownload` varchar(255) DEFAULT NULL COMMENT '下载文件',
  `hysMOtime` datetime DEFAULT (now()) COMMENT '上传时间',
  `hysMOtxt` varchar(10000) DEFAULT NULL COMMENT '模组内容',
  `hysMOsum` int DEFAULT NULL COMMENT '收藏数',
  PRIMARY KEY (`hysMOid`),
  KEY `hysMO_id_T_fk` (`hysMOidT`),
  KEY `hysmo_id_U_fk` (`hysMOidU`),
  CONSTRAINT `hysMO_id_T_fk` FOREIGN KEY (`hysMOidT`) REFERENCES `hyst` (`hysTid`),
  CONSTRAINT `hysmo_id_U_fk` FOREIGN KEY (`hysMOidU`) REFERENCES `hysu` (`hysUid`)
) ENGINE=InnoDB AUTO_INCREMENT=10063 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='模组表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hysmo`
--

LOCK TABLES `hysmo` WRITE;
/*!40000 ALTER TABLE `hysmo` DISABLE KEYS */;
INSERT INTO `hysmo` VALUES (10000,60000,10000,'情感本','情感本.jpg','test.txt','2024-12-29 21:24:20','这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本这个是情感本',20),(10001,60001,10000,'推理本','推理本.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10002,60002,10000,'推理本','1ddc4faf778376d9-1663300913140.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10003,60001,10001,'推理本','56feb807eed2d0a1-1685095130273.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10004,60001,10001,'推理本','8948ef302e5e2ed3-1674206301614.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10005,60003,10001,'推理本','bd90a92f3ac21ba8-1650856738514.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10006,60001,10004,'推理本','interlude_MDxTH_4.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10007,60001,10003,'推理本','StarRail_Image_1707486627.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10008,60004,10003,'情感本','StarRail_Image_1707486639.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10009,60000,10001,'情感本','手机壁纸.png','test.txt','2024-12-29 21:24:20','这个是情感本',22),(10010,60005,10003,'情感本','桌面壁纸.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10011,60000,10000,'情感本','桌面壁纸2.jpg','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10012,60005,10000,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10013,60000,10000,'情感本','桌面壁纸4.jpg','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10014,60005,10000,'情感本','桌面壁纸5.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10015,60000,10001,'情感本','桌面壁纸7.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10016,60002,10003,'推理本','1ddc4faf778376d9-1663300913140.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10017,60002,10003,'推理本','1ddc4faf778376d9-1663300913140.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10018,60002,10001,'推理本','1ddc4faf778376d9-1663300913140.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10019,60002,10000,'推理本','1ddc4faf778376d9-1663300913140.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10020,60002,10003,'推理本','1ddc4faf778376d9-1663300913140.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10021,60003,10001,'推理本','bd90a92f3ac21ba8-1650856738514.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10022,60003,10000,'推理本','bd90a92f3ac21ba8-1650856738514.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10023,60003,10000,'推理本','bd90a92f3ac21ba8-1650856738514.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10024,60003,10003,'推理本','bd90a92f3ac21ba8-1650856738514.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10025,60003,10001,'推理本','bd90a92f3ac21ba8-1650856738514.png','test.txt','2024-12-29 21:24:20','这个是推理本',20),(10026,60004,10000,'情感本','StarRail_Image_1707486639.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10027,60004,10003,'情感本','StarRail_Image_1707486639.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10028,60004,10000,'情感本','StarRail_Image_1707486639.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10029,60004,10001,'情感本','StarRail_Image_1707486639.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10030,60004,10000,'情感本','StarRail_Image_1707486639.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10031,60005,10003,'情感本','桌面壁纸.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10032,60005,10001,'情感本','桌面壁纸.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10033,60005,10003,'情感本','桌面壁纸.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10034,60005,10001,'情感本','桌面壁纸.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10035,60005,10000,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10036,60005,10000,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10037,60005,10001,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10038,60005,10000,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10039,60005,10001,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10040,60005,10000,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10041,60005,10000,'情感本','桌面壁纸3.png','test.txt','2024-12-29 21:24:20','这个是情感本',20),(10047,60002,10004,'123123','124222704_p0.jpg',NULL,'2024-12-30 22:06:11','1231231231231231231231123123',0),(10048,60003,10004,'11111','640.jpg',NULL,'2024-12-30 22:07:42','1111111',0),(10049,60002,10004,'2222','109984213_p2.jpg',NULL,'2024-12-30 22:10:45','2222',0),(10050,60001,10004,'333','QQ图片20221222171920.jpg',NULL,'2024-12-30 22:25:14','333',0),(10060,60004,10004,'9999','屏幕截图 2023-01-31 102600.png','banner.txt','2024-12-30 23:24:26','999',0),(10061,60000,10014,'111','125445262_p0.jpg','waimai.sql','2024-12-30 23:28:21','111',0);
/*!40000 ALTER TABLE `hysmo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hyss`
--

DROP TABLE IF EXISTS `hyss`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hyss` (
  `hysSid` int NOT NULL AUTO_INCREMENT COMMENT '收藏表id',
  `hysSidU` int DEFAULT NULL COMMENT '用户ID',
  `hysSidMO` int DEFAULT NULL COMMENT '模组id',
  `hysStime` datetime DEFAULT (now()) COMMENT '收藏时间',
  PRIMARY KEY (`hysSid`),
  KEY `hysS_id_MO_fk` (`hysSidMO`),
  KEY `hysS_id_U_fk` (`hysSidU`),
  CONSTRAINT `hysS_id_MO_fk` FOREIGN KEY (`hysSidMO`) REFERENCES `hysmo` (`hysMOid`),
  CONSTRAINT `hysS_id_U_fk` FOREIGN KEY (`hysSidU`) REFERENCES `hysu` (`hysUid`)
) ENGINE=InnoDB AUTO_INCREMENT=10032 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='收藏表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hyss`
--

LOCK TABLES `hyss` WRITE;
/*!40000 ALTER TABLE `hyss` DISABLE KEYS */;
INSERT INTO `hyss` VALUES (10000,10000,10000,'2024-12-29 21:25:21'),(10001,10004,10000,'2024-12-29 21:25:21'),(10002,10004,10001,'2024-12-29 21:25:21'),(10003,10004,10002,'2024-12-29 21:25:21'),(10006,10004,10003,'2024-12-29 21:25:21'),(10007,10004,10003,'2024-12-29 21:25:21'),(10009,10004,10003,'2024-12-29 21:25:21'),(10014,10004,10025,'2024-12-30 01:23:34'),(10015,10004,10026,'2024-12-30 01:23:37'),(10017,10000,10000,'2024-12-30 01:24:07'),(10018,10000,10008,'2024-12-30 01:24:09'),(10019,10000,10005,'2024-12-30 01:30:04'),(10020,10000,10007,'2024-12-30 01:30:09'),(10021,10000,10006,'2024-12-30 01:30:17'),(10022,10000,10009,'2024-12-30 01:30:25'),(10023,10000,10037,'2024-12-30 01:30:56'),(10027,10014,10017,'2024-12-30 23:28:37'),(10029,10004,10000,'2024-12-30 23:31:50'),(10030,10004,10009,'2024-12-31 00:31:03'),(10031,10004,10009,'2024-12-31 00:31:13');
/*!40000 ALTER TABLE `hyss` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hyst`
--

DROP TABLE IF EXISTS `hyst`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hyst` (
  `hysTid` int NOT NULL AUTO_INCREMENT COMMENT '分类ID',
  `hysTname` varchar(200) DEFAULT NULL COMMENT '分类名',
  PRIMARY KEY (`hysTid`)
) ENGINE=InnoDB AUTO_INCREMENT=60006 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='模组分类';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hyst`
--

LOCK TABLES `hyst` WRITE;
/*!40000 ALTER TABLE `hyst` DISABLE KEYS */;
INSERT INTO `hyst` VALUES (60000,'情感'),(60001,'推理'),(60002,'恐怖'),(60003,'心理'),(60004,'娱乐'),(60005,'穿越');
/*!40000 ALTER TABLE `hyst` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hysu`
--

DROP TABLE IF EXISTS `hysu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hysu` (
  `hysUid` int NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `hysUimg` varchar(255) DEFAULT NULL COMMENT '用户头像',
  `hysUname` varchar(200) DEFAULT NULL COMMENT '用户名',
  `hysUphone` varchar(11) DEFAULT NULL COMMENT '手机号',
  `hysUqq` varchar(50) DEFAULT NULL COMMENT 'QQ号',
  `hysUmile` varchar(50) DEFAULT NULL COMMENT '邮箱',
  `hysUpass` varchar(50) DEFAULT NULL COMMENT '密码',
  PRIMARY KEY (`hysUid`)
) ENGINE=InnoDB AUTO_INCREMENT=10015 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hysu`
--

LOCK TABLES `hysu` WRITE;
/*!40000 ALTER TABLE `hysu` DISABLE KEYS */;
INSERT INTO `hysu` VALUES (10000,'bd90a92f3ac21ba8-1650856738514.png','胡芸殊','12345678911','1234567','1234@123.123','123456'),(10001,'8948ef302e5e2ed3-1674206301614.png','白羊','12345678912','1234567','1234@123.123','123456'),(10003,'bd90a92f3ac21ba8-1650856738514.png','摩羯','12345678913','1234567','1234@123.123','123456'),(10004,'88148440_p3.jpg','摩羯','123123','123213','123123','111'),(10010,'屏幕截图 2023-03-10 225249.png','123','123123123','123','123','23'),(10011,'屏幕截图 2023-04-13 141856.png','111','111','111','111','111'),(10012,'屏幕截图 2023-03-31 235627.png','333','333','333','333','333'),(10014,'2024.02.19.png','234','234','234','234','234');
/*!40000 ALTER TABLE `hysu` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-12-31  2:07:49
